CREATE DATABASE bot_db;

\c bot_db

CREATE SCHEMA bot;


CREATE TABLE bot.subject (
	id SERIAL primary key, 
	name VARCHAR NOT NULL);

CREATE TABLE bot.teacher (
	id SERIAL primary key, 
	full_name VARCHAR NOT NULL, 
	subject INT NOT NULL,
	FOREIGN KEY (subject) REFERENCES bot.subject (id));

CREATE TABLE bot.timetable (
	id SERIAL primary key,
	day VARCHAR NOT NULL,
	subject INT NOT NULL,
	start_time VARCHAR NOT NULL,
	end_time VARCHAR NOT NULL,
	room_numb VARCHAR NOT NULL,
	week INT NOT NULL,
	FOREIGN KEY (subject) REFERENCES bot.subject (id));

INSERT INTO bot.subject (name) VALUES
('Высшая математика  (Лекция)'), 
('Иностранный язык  (Практика)'), 
('История  (Практика)'), 
('Высшая математика  (Практика)'), 
('Игровые виды спорта  (Практика)'), 
('Основы DevOps  (Лекция)'), 
('Физика  (Практика)'), 
('Математические основы баз данных  (Практика)'), 
('Основы DevOps  (Лаб. занятие)'), 
('Введение в информационные технологии  (Лаб. занятие)'), 
('Введение в информационные технологии  (Практика)'), 
('Проектный практикум  (Практика)'), 
('Физика  (Лекция)'), 
('История  (Лекция)'), 
('Математические основы баз данных  (Лекция)'), 
('Физика  (Лаб. занятие)'), 
('Математические основы баз данных  (Лаб. занятие)');

INSERT INTO bot.teacher (full_name, subject) VALUES
('Шаймарданова Л. К.', 1), 
('Воронова Е. В.', 2), 
('Скляр Л. Н.', 3), 
('Шаймарданова Л. К.', 4), 
('Волохова С. В.', 5), 
('Городничев М. Г.', 6), 
('Дегтярёв В. Ф.', 7), 
('Полищук Ю. В.', 8), 
('Липатов В. Н.', 9), 
('Фурлетов Ю. М.', 10), 
('Фурлетов Ю. М.', 11), 
('Потапченко Т. Д.', 12), 
('Вальковский С. Н.', 13), 
('Скляр Л. Н.', 14), 
('Полищук Ю. В.', 15), 
('Тимошина М. И.', 16), 
('Изотова А. А.', 17);

INSERT INTO bot.timetable (day, subject, start_time, end_time, room_numb, week) VALUES
('ПОНЕДЕЛЬНИК', 1, '11:20', '12:55', '514 (ОП)', 0), 
('ПОНЕДЕЛЬНИК', 2, '13:10', '14:45', '324 (ОП)', 0), 
('ПОНЕДЕЛЬНИК', 3, '15:25', '17:00', '318 (ОП)', 0), 
('ПОНЕДЕЛЬНИК', 4, '17:15', '18:50', '301 (ОП)', 0), 
('СРЕДА', 5, '11:20', '12:55', 'спортзал (А)', 0), 
('СРЕДА', 6, '13:10', '14:45', 'А-414 (А)', 0), 
('ЧЕТВЕРГ', 7, '11:20', '12:55', '332б (ОП)', 0), 
('ЧЕТВЕРГ', 8, '13:10', '14:45', '404 (ОП)', 0), 
('ЧЕТВЕРГ', 5, '15:25', '17:00', 'спортзал (ОП)', 0), 
('ПЯТНИЦА', 9, '09:30', '11:05', 'ВЦ-302 (А)', 0), 
('ПЯТНИЦА', 10, '11:20', '12:55', 'Л-207 (А)', 0), 
('ПОНЕДЕЛЬНИК', 10, '13:10', '14:45', 'Л-203 (А)', 1), 
('ПОНЕДЕЛЬНИК', 5, '15:25', '17:00', 'спортзал (А)', 1), 
('ВТОРНИК', 11, '11:20', '12:55', 'Л-206 (А)', 1), 
('ВТОРНИК', 9, '13:10', '14:45', 'ВЦ-302 (А)', 1), 
('ВТОРНИК', 12, '15:25', '17:00', 'Л-205 (А)', 1), 
('ВТОРНИК', 5, '17:15', '18:50', 'спортзал (А)', 1), 
('СРЕДА', 2, '09:30', '11:05', '314 (ОП)', 1), 
('СРЕДА', 4, '11:20', '12:55', '301 (ОП)', 1), 
('СРЕДА', 1, '13:10', '14:45', '514 (ОП)', 1), 
('СРЕДА', 13, '15:25', '17:00', '226 (ОП)', 1), 
('ПЯТНИЦА', 14, '09:30', '11:05', '227 (ОП)', 1), 
('ПЯТНИЦА', 15, '11:20', '12:55', '535 (ОП)', 1), 
('ПЯТНИЦА', 16, '13:10', '14:45', '340 (ОП)', 1), 
('ПЯТНИЦА', 3, '15:25', '17:00', '318 (ОП)', 1), 
('ПЯТНИЦА', 17, '17:15', '18:50', '131 (ОП)', 1);